{
  "terms": [
    {"term": "IMPI", "definition": "Intelligent Platform Management Interface: a set of standardized specifications for hardware-based platform management systems."},
    {"term": "ICMP", "definition": "Internet Control Message Protocol: used by network devices to send error messages and operational information."},
    {"term": "BGP", "definition": "Border Gateway Protocol: a standardized exterior gateway protocol used to exchange routing information between autonomous systems on the Internet."},
    {"term": "Linux", "definition": "An open-source family of Unix-like operating systems based on the Linux kernel, widely used in servers, desktops, and embedded systems."},
    {"term": "CIA Triad", "definition": "Confidentiality, Integrity, and Availability: the three core principles of information security."},
    {"term": "Confidentiality", "definition": "Ensuring that information is accessible only to those authorized to have access."},
    {"term": "Integrity", "definition": "Maintaining the accuracy and completeness of data."},
    {"term": "Availability", "definition": "Ensuring that authorized users have access to information and resources when needed."},
    {"term": "AAA", "definition": "Authentication, Authorization, and Accounting: a framework for intelligently controlling access to computer resources."},
    {"term": "IDS", "definition": "Intrusion Detection System: a device or software application that monitors a network for malicious activity or policy violations."},
    {"term": "IPS", "definition": "Intrusion Prevention System: a network security/threat prevention technology that examines network traffic flows to detect and prevent vulnerability exploits."},
    {"term": "SIEM", "definition": "Security Information and Event Management: a solution that provides real-time analysis of security alerts generated by applications and network hardware."},
    {"term": "DLP", "definition": "Data Loss Prevention: strategies and tools used to prevent data breaches, exfiltration, or unwanted destruction of sensitive data."},
    {"term": "VPN", "definition": "Virtual Private Network: extends a private network across a public network and enables users to send and receive data as if their devices were directly connected to the private network."},
    {"term": "Phishing", "definition": "A fraudulent attempt to obtain sensitive information by disguising as a trustworthy entity in electronic communication."},
    {"term": "Malware", "definition": "Malicious software designed to harm, exploit, or otherwise compromise a computer system."},
    {"term": "Firewall", "definition": "A network security device that monitors and controls incoming and outgoing network traffic based on predetermined security rules."},
    {"term": "Zero-Day", "definition": "A vulnerability in software that is unknown to the vendor and has not been patched."},
    {"term": "Penetration Testing", "definition": "A simulated cyberattack against your computer system to check for exploitable vulnerabilities."},
    {"term": "Social Engineering", "definition": "The psychological manipulation of people into performing actions or divulging confidential information."},
    {"term": "RADIUS", "definition": "Remote Authentication Dial-In User Service: a networking protocol that provides centralized Authentication, Authorization, and Accounting (AAA) management."},
    {"term": "TACACS+", "definition": "Terminal Access Controller Access-Control System Plus: a protocol that handles authentication, authorization, and accounting services for networked access control."},
    {"term": "802.1X", "definition": "A network access control protocol for securing wireless and wired networks."},
    {"term": "PKI", "definition": "Public Key Infrastructure: a framework for managing digital certificates and public-key encryption."},
    {"term": "TLS", "definition": "Transport Layer Security: a cryptographic protocol designed to provide secure communication over a computer network."},
    {"term": "SSL", "definition": "Secure Sockets Layer: a deprecated cryptographic protocol for securing data transmitted over the Internet."},
    {"term": "DoS", "definition": "Denial of Service: an attack meant to shut down a machine or network, making it inaccessible to its intended users."},
    {"term": "DDoS", "definition": "Distributed Denial of Service: a cyber-attack where the perpetrator uses more than one unique IP address, often thousands of them."},
    {"term": "Botnet", "definition": "A network of private computers infected with malicious software and controlled as a group without the owners' knowledge."},
    {"term": "Man-in-the-Middle (MitM)", "definition": "An attack where the attacker secretly intercepts and relays messages between two parties who believe they are communicating directly with each other."},
    {"term": "Hashing", "definition": "The process of converting data into a fixed-size string of characters, which is typically a hash value."},
    {"term": "Symmetric Encryption", "definition": "A type of encryption where the same key is used for both encryption and decryption."},
    {"term": "Asymmetric Encryption", "definition": "A type of encryption that uses a pair of keys, one public and one private."},
    {"term": "RSA", "definition": "A widely used public-key cryptosystem for secure data transmission."},
    {"term": "AES", "definition": "Advanced Encryption Standard: a symmetric encryption algorithm widely used across the globe."},
    {"term": "DES", "definition": "Data Encryption Standard: an outdated symmetric-key method of data encryption."},
    {"term": "3DES", "definition": "Triple Data Encryption Standard: an encryption algorithm that applies the DES cipher algorithm three times to each data block."},
    {"term": "Sandboxing", "definition": "A security mechanism for separating running programs, usually in an effort to mitigate system failures or software vulnerabilities from spreading."},
    {"term": "Patch Management", "definition": "The process of managing a network of computers by regularly performing patch deployment to keep computers up to date."},
    {"term": "Least Privilege", "definition": "A security principle in which a user is given the minimum levels of access needed to perform his/her job functions."},
    {"term": "Multi-factor Authentication (MFA)", "definition": "A security system that requires more than one method of authentication from independent categories of credentials."},
    {"term": "Single Sign-On (SSO)", "definition": "A session and user authentication service that permits a user to use one set of login credentials to access multiple applications."},
    {"term": "SAML", "definition": "Security Assertion Markup Language: an open standard for exchanging authentication and authorization data between parties."},
    {"term": "OAuth", "definition": "An open standard for access delegation commonly used as a way to grant websites or applications limited access to user information without exposing passwords."},
    {"term": "OpenID Connect", "definition": "An authentication layer on top of OAuth 2.0, allowing clients to verify the identity of end-users."},
    {"term": "Federation", "definition": "A system that allows the sharing of identities and resources across different organizations or domains."},
    {"term": "Access Control List (ACL)", "definition": "A list of permissions attached to an object that specifies which users or system processes can access that object."},
    {"term": "Mandatory Access Control (MAC)", "definition": "A security model in which access rights are regulated by a central authority based on multiple levels of security."},
    {"term": "Discretionary Access Control (DAC)", "definition": "A type of access control system that allows the owner of the resource to specify who can access it."},
    {"term": "Role-Based Access Control (RBAC)", "definition": "A method of regulating access to computer or network resources based on the roles of individual users within an enterprise."},
    {"term": "Rule-Based Access Control", "definition": "A type of access control that uses a set of rules to determine whether access requests should be granted or denied."},
    {"term": "SIEM", "definition": "Security Information and Event Management: a solution that provides real-time analysis of security alerts generated by applications and network hardware."},
    {"term": "UEBA", "definition": "User and Entity Behavior Analytics: cybersecurity processes that analyze user behavior to detect threats."},
    {"term": "SOAR", "definition": "Security Orchestration, Automation, and Response: a stack of compatible software programs that allows an organization to collect data about security threats and respond to security events without human assistance."},
    {"term": "Vulnerability Assessment", "definition": "A systematic review of security weaknesses in an information system."},
    {"term": "Risk Assessment", "definition": "The process of identifying, evaluating, and estimating the levels of risk involved in a situation."},
    {"term": "Business Continuity Plan (BCP)", "definition": "A plan to ensure that business processes can continue during a time of emergency or disaster."},
    {"term": "Disaster Recovery Plan (DRP)", "definition": "A documented process or set of procedures to recover and protect a business IT infrastructure in the event of a disaster."},
    {"term": "Incident Response Plan (IRP)", "definition": "A set of instructions to help IT staff detect, respond to, and recover from network security incidents."},
    {"term": "GDPR", "definition": "General Data Protection Regulation: a legal framework that sets guidelines for the collection and processing of personal information from individuals who live in the European Union (EU)."},
    {"term": "HIPAA", "definition": "Health Insurance Portability and Accountability Act: a US law designed to provide privacy standards to protect patients' medical records and other health information."},
    {"term": "PCI DSS", "definition": "Payment Card Industry Data Security Standard: a set of security standards designed to ensure that all companies that accept, process, store or transmit credit card information maintain a secure environment."},
    {"term": "SOX", "definition": "Sarbanes-Oxley Act: a US law that sets requirements for all US public company boards, management, and public accounting firms."},
    {"term": "NIST", "definition": "National Institute of Standards and Technology: a non-regulatory agency of the United States Department of Commerce that develops technology, metrics, and standards."},
    {"term": "FISMA", "definition": "Federal Information Security Management Act: a United States legislation that defines a comprehensive framework to protect government information, operations and assets against natural or man-made threats."},
    {"term": "OWASP", "definition": "Open Web Application Security Project: an online community that produces freely-available articles, methodologies, documentation, tools, and technologies in the field of web application security."},
    {"term": "Threat Intelligence", "definition": "Information about threats and threat actors that helps mitigate harmful events in cyberspace."},
    {"term": "Threat Hunting", "definition": "The practice of proactively searching for cyber threats that are lurking undetected in a network."},
    {"term": "Red Team", "definition": "A group that plays the role of an adversary to provide security feedback from an attacker's perspective."},
    {"term": "Blue Team", "definition": "A group responsible for maintaining the internal network defenses against all cyber attacks and threats."},
    {"term": "Purple Team", "definition": "A team that bridges the gap between red and blue teams to maximize the effectiveness of both."},
    {"term": "Kill Chain", "definition": "A model for the identification and prevention of cyber intrusions activity."},
    {"term": "MITRE ATT&CK", "definition": "A globally-accessible knowledge base of adversary tactics and techniques based on real-world observations."},
    {"term": "Zero Trust", "definition": "A security concept centered on the belief that organizations should not automatically trust anything inside or outside its perimeters and instead must verify anything and everything trying to connect to its systems before granting access."},
    {"term": "Cloud Access Security Broker (CASB)", "definition": "A software tool or service that sits between an organization's on-premises infrastructure and a cloud provider's infrastructure."},
    {"term": "IaaS", "definition": "Infrastructure as a Service: a form of cloud computing that provides virtualized computing resources over the internet."},
    {"term": "PaaS", "definition": "Platform as a Service: a category of cloud computing services that provides a platform allowing customers to develop, run, and manage applications."},
    {"term": "SaaS", "definition": "Software as a Service: a software distribution model in which a third-party provider hosts applications and makes them available to customers over the Internet."},
    {"term": "Public Cloud", "definition": "A cloud service offered over the public internet and available to anyone who wants to purchase the service."},
    {"term": "Private Cloud", "definition": "A cloud computing environment dedicated to a single organization."},
    {"term": "Hybrid Cloud", "definition": "A computing environment that combines a public cloud and a private cloud by allowing data and applications to be shared between them."},
    {"term": "VLAN", "definition": "Virtual Local Area Network: a logical subgroup within a local area network that is created via software rather than hardware."},
    {"term": "NAC", "definition": "Network Access Control: a set of technologies and policies designed to secure, control, and manage access to network resources."},
    {"term": "802.11", "definition": "A set of standards for implementing wireless local area network (WLAN) computer communication."},
    {"term": "WPA2", "definition": "Wi-Fi Protected Access 2: a security protocol and security certification program developed by the Wi-Fi Alliance to secure wireless computer networks."},
    {"term": "WPA3", "definition": "Wi-Fi Protected Access 3: the latest security protocol developed by the Wi-Fi Alliance to secure wireless computer networks."},
    {"term": "TKIP", "definition": "Temporal Key Integrity Protocol: a security protocol used in the IEEE 802.11 wireless networking standard."},
    {"term": "AES-CCMP", "definition": "Advanced Encryption Standard - Counter Mode with Cipher Block Chaining Message Authentication Code Protocol: an encryption protocol used in WPA2."},
    {"term": "Rogue Access Point", "definition": "An unauthorized wireless access point installed in a network's physical or logical perimeter."},
    {"term": "Evil Twin", "definition": "A rogue wireless access point that masquerades as a legitimate one to eavesdrop on wireless communications."},
    {"term": "Bluejacking", "definition": "The sending of unsolicited messages over Bluetooth to Bluetooth-enabled devices."},
    {"term": "Bluesnarfing", "definition": "The unauthorized access of information from a wireless device through a Bluetooth connection."},
    {"term": "RFID", "definition": "Radio Frequency Identification: a technology that uses electromagnetic fields to automatically identify and track tags attached to objects."},
    {"term": "NFC", "definition": "Near Field Communication: a set of communication protocols that enable two electronic devices to communicate when they are within 4 cm of each other."},
    {"term": "SCADA", "definition": "Supervisory Control and Data Acquisition: a system of software and hardware elements that allows industrial organizations to control processes locally or at remote locations."},
    {"term": "ICS", "definition": "Industrial Control System: an umbrella term used to describe different types of control systems and associated instrumentation, which include the devices, systems, networks, and controls used to operate and/or automate industrial processes."},
    {"term": "OT", "definition": "Operational Technology: hardware and software that detects or causes a change through the direct monitoring and/or control of physical devices, processes and events in the enterprise."},
    {"term": "IoT", "definition": "Internet of Things: the network of physical objects—'things'—that are embedded with sensors, software, and other technologies for the purpose of connecting and exchanging data with other devices and systems over the internet."},
    {"term": "BYOD", "definition": "Bring Your Own Device: a policy that allows employees to bring their own devices to work and use them to access company information and applications."},
    {"term": "MAM", "definition": "Mobile Application Management: software and services responsible for provisioning and controlling access to internally developed and commercially available mobile apps used in business settings on both company-provided and 'bring your own' smartphones and tablet computers."},
    {"term": "MDM", "definition": "Mobile Device Management: software that allows IT administrators to control, secure, and enforce policies on smartphones, tablets, and other endpoints."},
    {"term": "Containerization", "definition": "A lightweight form of virtualization that involves encapsulating an application and its dependencies into a container that can run on any computing environment."},
    {"term": "Data at Rest", "definition": "Data that is stored on a device or backup medium in any form."},
    {"term": "Data in Transit", "definition": "Data that is actively moving from one location to another, such as across the internet or through a private network."},
    {"term": "Data in Use", "definition": "Data that is currently being processed by applications."},
    {"term": "Obfuscation", "definition": "The action of making something obscure, unclear, or unintelligible, often used in the context of code or data to make it harder to understand or reverse engineer."},
    {"term": "Steganography", "definition": "The practice of concealing messages or information within other non-secret text or data."},
    {"term": "Tokenization", "definition": "The process of substituting a sensitive data element with a non-sensitive equivalent, referred to as a token, that has no extrinsic or exploitable meaning or value."},
    {"term": "Salting", "definition": "The process of adding random data to input data before it is hashed, to ensure that the output hash is unique even for identical inputs."},
    {"term": "Rainbow Table", "definition": "A precomputed table for reversing cryptographic hash functions, primarily used for cracking password hashes."},
    {"term": "Brute Force Attack", "definition": "A trial-and-error method used to decode encrypted data such as passwords or Data Encryption Standard (DES) keys."},
    {"term": "Dictionary Attack", "definition": "A method of breaking into a password-protected computer or server by systematically entering every word in a dictionary as a password."},
    {"term": "Privilege Escalation", "definition": "The act of exploiting a bug, design flaw or configuration oversight in an operating system or software application to gain elevated access to resources that are normally protected from an application or user."},
    {"term": "Pivoting", "definition": "A method used by penetration testers and attackers to move from a compromised system to other systems on the same network to gain further access."},
    {"term": "Lateral Movement", "definition": "The techniques that cyber attackers use, after gaining initial access, to move deeper into a network in search of sensitive data and other high-value assets."},
    {"term": "Persistence", "definition": "The ability of an attacker to maintain a foothold in a compromised environment."},
    {"term": "Rootkit", "definition": "A collection of computer software, typically malicious, designed to enable access to a computer or areas of its software that would not otherwise be allowed."},
    {"term": "Logic Bomb", "definition": "A piece of code intentionally inserted into a software system that will set off a malicious function when specified conditions are met."},
    {"term": "Spyware", "definition": "Software that enables a user to obtain covert information about another's computer activities by transmitting data covertly from their hard drive."},
    {"term": "Adware", "definition": "Software that automatically displays or downloads advertising material when a user is online."},
    {"term": "Ransomware", "definition": "A type of malicious software designed to block access to a computer system until a sum of money is paid."},
    {"term": "Worm", "definition": "A standalone malware computer program that replicates itself in order to spread to other computers."},
    {"term": "Trojan Horse", "definition": "A type of malware that is often disguised as legitimate software."},
    {"term": "Backdoor", "definition": "A method, often secret, of bypassing normal authentication or encryption in a computer system, product, or embedded device."},
    {"term": "Polymorphic Malware", "definition": "Malware that constantly changes its identifiable features in order to evade detection."},
    {"term": "Armored Virus", "definition": "A virus that is designed to make itself difficult to detect or analyze."},
    {"term": "Fileless Malware", "definition": "Malware that operates in memory and does not write its code to disk, making it harder to detect."},
    {"term": "Supply Chain Attack", "definition": "A cyber-attack that seeks to damage an organization by targeting less-secure elements in the supply chain."},
    {"term": "Watering Hole Attack", "definition": "A security exploit in which the attacker seeks to compromise a specific group of end users by infecting websites that members of the group are known to visit."},
    {"term": "Tailgating", "definition": "A physical security breach in which an unauthorized person follows an authorized individual to enter a secured premise."},
    {"term": "Shoulder Surfing", "definition": "A direct observation technique, such as looking over someone's shoulder, to get information."},
    {"term": "Dumpster Diving", "definition": "The practice of searching through commercial or residential waste to find items that can be used to gain unauthorized access to information or resources."},
    {"term": "Pharming", "definition": "A cyberattack intended to redirect a website's traffic to another, fake site."},
    {"term": "Vishing", "definition": "The fraudulent practice of making phone calls or leaving voice messages purporting to be from reputable companies in order to induce individuals to reveal personal information."},
    {"term": "Smishing", "definition": "A form of phishing that uses SMS messages to trick users into revealing information or installing malware."},
    {"term": "Whaling", "definition": "A specific form of phishing that targets high-profile individuals such as executives or politicians."},
    {"term": "Spear Phishing", "definition": "A targeted attempt to steal sensitive information such as account credentials or financial information from a specific victim, often for malicious reasons, by masquerading as a trustworthy entity or person in electronic communications."}
  ]
}